<?php

return [

    'title' => 'Рестартирайте паролата си',

    'heading' => 'Забравена парола?',

    'actions' => [

        'login' => [
            'label' => 'назад към входа',
        ],

    ],

    'form' => [

        'email' => [
            'label' => 'Имейл адрес',
        ],

        'actions' => [

            'request' => [
                'label' => 'Изпрати линк за рестартиране на паролата',
            ],

        ],

    ],

    'notifications' => [

        'throttled' => [
            'title' => 'Прекалено много опити за рестартиране на паролата',
            'body' => 'Моля, опитайте отново след :seconds секунди.',
        ],

    ],

];
