<?php

return [
    "password_confirm" => [
        "heading" => "Потвърдете паролата",
        "description" => "За да продължите, моля потвърдете паролата си.",
        "current_password" => "Текуща парола",
    ],
    "two_factor" => [
        "heading" => "Двуфакторна проверка",
        "description" => "Моля потвърдете достъпа до вашия акаунт, като въведете кода за двуфакторна проверка, предоставен от приложението на вашето мобилно устройство.",
        "code_placeholder" => "XXX-XXX",
        "recovery" => [
            "heading" => "Възстановяване на код",
            "description" => "Ако сте изгубили устройството си за двуфакторна проверка, можете да възстановите достъпа до вашия акаунт, като въведете код за възстановяване.",
        ],
        "recovery_code_placeholder" => "abcdef-98765",
        "recovery_code_text" => "Изгубено устройство?",
        "recovery_code_link" => "Използвайте код за възстановяване",
        "back_to_login_link" => "Назад към входа",
    ],
    "profile" => [
        "account" => "Акаунт",
        "profile" => "Профил",
        "my_profile" => "Моят профил",
        "subheading" => "Управлявайте своя профил и настройки на акаунта.",
        "personal_info" => [
            "heading" => "Лична информация",
            "subheading" => "Актуализирайте личната си информация и имейл адрес.",
            "submit" => [
                "label" => "Запази",
            ],
            "notify" => "Профилът е актуализиран успешно!",
        ],
        "password" => [
            "heading" => "Промяна на паролата",
            "subheading" => "Променете паролата си. Минималната дължина на паролата е 8 знака.",
            "submit" => [
                "label" => "Запази",
            ],
            "notify" => "Паролата е променена успешно!",
        ],
        "2fa" => [
            "title" => "Двуфакторна проверка",
            "description" => "Добавете допълнителна сигурност към своя акаунт, като включите двуфакторна проверка.",
            "actions" => [
                "enable" => "Включи",
                "regenerate_codes" => "Генерирай нови кодове",
                "disable" => "Изключи",
                "confirm_finish" => "Потвърди и завърши",
                "cancel_setup" => "Отмени настройката",
            ],
            "setup_key" => "Ключ за настройка",
            "must_enable" => "Трябва да включите двуфакторна проверка, за да продължите.",
            "not_enabled" => [
                "title" => "Двуфакторна проверка не е включена",
                "description" => "Когато двуфакторната проверка е включена, ще бъдете помолени за сигурен, случаен токен по време на удостоверяване. Можете да получите този токен от приложението Google Authenticator на телефона си."
            ],
            "finish_enabling" => [
                "title" => "Завършване на включването на двуфакторна проверка",
                "description" => "За да завършите включването на двуфакторна проверка, сканирайте следния QR код с приложението за удостоверяване на телефона си или въведете ключа за настройка и предоставете генерирания OTP код."
            ],
            "enabled" => [
                "notify" => "Двуфакторната проверка е включена успешно!",
                "title" => "Двуфакторна проверка е включена",
                "description" => "Двуфакторната проверка е включена. Това помага да направите акаунта си по-сигурен.",
                "store_codes" => "Тези кодове могат да се използват за възстановяване на достъпа до вашия акаунт, ако устройството ви е загубено. Внимание! Тези кодове ще бъдат показани само веднъж.",
            ],
            "disabling" => [
                "notify" => "Двуфакторната проверка е изключена успешно!",
            ],
            "regenerate_codes" => [
                "notify" => "Кодовете са регенерирани успешно!",
            ],
            "confirmation" => [
                "success_notification" => 'Кодът е валиден! Вече можете да завършите настройката на двуфакторната проверка.',
                "invalid_code" => "Кодът е невалиден. Моля опитайте отново.",
            ]
        ],
        "sanctum" => [
            "title" => "API токени",
            "description" => "Управлявайте API токените, които позволяват на услуги от трети страни да получават достъп до това приложение от ваше име.",
            "create" => [
                "notify" => "Токенът е създаден успешно!",
                "message" => "Токенът е създаден успешно! Моля копирайте този токен. Той няма да бъде показан отново.",
                "submit" => [
                    "label" => "Създай токен",
                ],
            ],
            "update" => [
                "notify" => "Токенът е актуализиран успешно!",
            ],
            "copied" => [
                "label" => "Копирах токена",
            ]
        ],
    ],
    "clipboard" => [
        "link" => "Копирай линка",
        "tooltip" => "Копирано!"
    ],
    "fields" => [
        "avatar" => "Аватар",
        "email" => "Email",
        "login" => "Вход",
        "name" => "Име",
        "password" => "Парола",
        "password_confirm" => "Потвърди паролата",
        "new_password" => "Нова парола",
        "new_password_confirmation" => "Потвърди новата парола",
        "token_name" => "Име на токенът",
        "token_expiry" => "Валидност на токена",
        "abilities" => "Права",
        "2fa_code" => "Код за двуфакторна проверка",
        "2fa_recovery_code" => "Код за възстановяване",
        'created' => 'Създаден',
        'expires' => "Изтича",
    ],
    "or" => "Или",
    "cancel" => "Отмени",
];
